Revit 2027 API
NavisworksCoordinates Enumeration
 An enumerated type listing possible Coordinates of Navisworks Exporter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum NavisworksCoordinates
Public Enumeration NavisworksCoordinates
public enum class NavisworksCoordinates
type NavisworksCoordinates
Members
Member name | Value | Description
Internal | 0 |  Use Revit internal coordinates.
Shared | 1 |  Shared coordinates can be viewed and modified outside of Revit.
See Also
Reference
Autodesk.Revit.DB Namespace